
public class Exam01 {

	public static void main(String[] args) {
		
		//MVC 패턴 (Model View Controller)
		//Model : 데이터들이 표현되는 역할.
		//View : 보여지는 것. (사용자의 입장)
		//Controller : 기능을 담당하는 역할
		
		
		//상속(InHeritance)
		//기존 코드를 그대로 재사용하거나 재정의 ->>> 재사용 + 확장
		//장점
		//1. 코드의 중복감소, 클래스 간결화
		//2. 신뢰성 있는 프로그램 손쉽게 개발.(먼저 작성되어있는 검증된 프로그램을 재사용)
		//3. 유지보수 용이(클래스간 계증척 분류 및 관리)
		
		//상속 특징
		//1. 자바의 상속은 다중상속을 지원하지 않는다.(여러명의 부모가 있을 수 없다.)
		//2. 상속의 횟수에 제한을 두지 않는다.
		//3. 최상위 클래스는 Object 이다.(object는 클래스의 기본적인 기능을 가지고 있다)
		
		
	}

}
